# parameters
nc: 1  # number of classes
depth_multiple: 1.0  
width_multiple: 1.0  

# anchors
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# YOLOv5 backbone
backbone:
  # MobileNetV3-large
  # [from, number, module, args]
  [[-1, 1, conv_bn_hswish, [16, 2]],                   # 0-p1/2
   [-1, 1, AsymmBottleneck3, [ 16,  16,  3, 1,   False, 1]],  # 1-p1/2
   [-1, 1, AsymmBottleneck3, [ 24,  64,  3, 1,   False, 2]],  # 2-p2/4
   [-1, 1, AsymmBottleneck3, [ 24,  72,  3, 1,   False, 1]],  # 3-p2/4
   [-1, 1, AsymmBottleneck3, [ 40,  72,  5, 1,   True,  2]],  # 4-p3/8
   [-1, 1, AsymmBottleneck3, [ 40,  120, 5, 1,   True,  1]],  # 5-p3/8
   [-1, 1, AsymmBottleneck3, [ 40,  120, 5, 1,   True,  1]],  # 6-p3/8
   [-1, 1, AsymmBottleneck3, [ 80,  240, 3, 1,  False, 2]],  # 7-p4/16
   [-1, 1, AsymmBottleneck3, [ 80,  200, 3, 1,  False, 1]],  # 8-p4/16
   [-1, 1, AsymmBottleneck3, [ 80,  184, 3, 1,  False, 1]],  # 9-p4/16
   [-1, 1, AsymmBottleneck3, [ 80,  184, 3, 1,  False, 1]],  # 10-p4/16
   [-1, 1, AsymmBottleneck3, [ 112, 480, 3, 1,  True,  1]],  # 11-p4/16
   [-1, 1, AsymmBottleneck3, [ 112, 672, 3, 1,  True,  1]],  # 12-p4/16
   [-1, 1, AsymmBottleneck3, [ 160, 672, 5, 1,  True,  2]],  # 13-p5/32
   [-1, 1, AsymmBottleneck3, [ 160, 960, 5, 1,  True,  1]],  # 14-p5/32
   [-1, 1, AsymmBottleneck3, [ 160, 960, 5, 1,  True,  1]],  # 15-p5/32

  ]



head:
  [[-1, 1, Conv, [256, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 12], 1, Concat, [1]],  # cat backbone P4
   [-1, 1, BottleneckCSP, [256, False]],  # 19

   [-1, 1,Conv, [128, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 6], 1, Concat, [1]],  # cat backbone P3
   [-1, 1,  BottleneckCSP, [128, False]],  # 23 (P3/8-small)

   [-1, 1, Conv, [128, 3, 2]],
   [[-1, 20], 1, Concat, [1]],  # cat head P4
   [-1, 1,  BottleneckCSP, [256, False]],  # 26 (P4/16-medium)

   [-1, 1,Conv, [256, 3, 2]],
   [[-1, 16], 1, Concat, [1]],  # cat head P5
   [-1, 1,  BottleneckCSP, [512, False]],  # 29 (P5/32-large)

   [[23, 26, 29], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]
